zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54018J4MET180-pinctrl.h
/*
 * NOTE: File generated by gen_soc_headers.py
 * from LPC54018J4MET180/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on LPC54628J512ET180-pinctrl.h with this part's differences applied
 * below (310 removed, 0 changed,
 * 16 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: d221021fcc6aabff
 */

#ifndef _ZEPHYR_DTS_BINDING_LPC54018J4MET180_WRAPPER_
#define _ZEPHYR_DTS_BINDING_LPC54018J4MET180_WRAPPER_

#include "LPC54628J512ET180-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_CH11_PIO0_23
#undef ADC0_TRIG1_PIO0_23
#undef ADC0_TRIG1_PIO0_24
#undef ADC0_TRIG1_PIO0_25
#undef ADC0_TRIG1_PIO0_26
#undef ADC0_TRIG1_PIO0_27
#undef ADC0_TRIG1_PIO0_28
#undef ADC0_TRIG2_PIO0_23
#undef ADC0_TRIG2_PIO0_24
#undef ADC0_TRIG2_PIO0_25
#undef ADC0_TRIG2_PIO0_26
#undef ADC0_TRIG2_PIO0_27
#undef ADC0_TRIG2_PIO0_28
#undef CLKOUT_PIO0_26
#undef CTIMER1_MATCH2_PIO0_23
#undef CTIMER2_CAPTURE0_PIO0_24
#undef CTIMER2_CAPTURE1_PIO0_25
#undef CTIMER2_CAPTURE3_PIO0_28
#undef CTIMER3_CAPTURE2_PIO0_26
#undef CTIMER3_MATCH2_PIO0_27
#undef CTIMER3_MATCH3_PIO0_23
#undef CTIMER4_MATCH2_PIO4_15
#undef CTIMER4_MATCH3_PIO4_16
#undef DMA0_TRIG0_PIO0_23
#undef DMA0_TRIG0_PIO0_24
#undef DMA0_TRIG0_PIO0_25
#undef DMA0_TRIG0_PIO0_26
#undef DMA0_TRIG0_PIO0_27
#undef DMA0_TRIG0_PIO0_28
#undef DMA0_TRIG10_PIO0_23
#undef DMA0_TRIG10_PIO0_24
#undef DMA0_TRIG10_PIO0_25
#undef DMA0_TRIG10_PIO0_26
#undef DMA0_TRIG10_PIO0_27
#undef DMA0_TRIG10_PIO0_28
#undef DMA0_TRIG11_PIO0_23
#undef DMA0_TRIG11_PIO0_24
#undef DMA0_TRIG11_PIO0_25
#undef DMA0_TRIG11_PIO0_26
#undef DMA0_TRIG11_PIO0_27
#undef DMA0_TRIG11_PIO0_28
#undef DMA0_TRIG12_PIO0_23
#undef DMA0_TRIG12_PIO0_24
#undef DMA0_TRIG12_PIO0_25
#undef DMA0_TRIG12_PIO0_26
#undef DMA0_TRIG12_PIO0_27
#undef DMA0_TRIG12_PIO0_28
#undef DMA0_TRIG13_PIO0_23
#undef DMA0_TRIG13_PIO0_24
#undef DMA0_TRIG13_PIO0_25
#undef DMA0_TRIG13_PIO0_26
#undef DMA0_TRIG13_PIO0_27
#undef DMA0_TRIG13_PIO0_28
#undef DMA0_TRIG14_PIO0_23
#undef DMA0_TRIG14_PIO0_24
#undef DMA0_TRIG14_PIO0_25
#undef DMA0_TRIG14_PIO0_26
#undef DMA0_TRIG14_PIO0_27
#undef DMA0_TRIG14_PIO0_28
#undef DMA0_TRIG15_PIO0_23
#undef DMA0_TRIG15_PIO0_24
#undef DMA0_TRIG15_PIO0_25
#undef DMA0_TRIG15_PIO0_26
#undef DMA0_TRIG15_PIO0_27
#undef DMA0_TRIG15_PIO0_28
#undef DMA0_TRIG16_PIO0_23
#undef DMA0_TRIG16_PIO0_24
#undef DMA0_TRIG16_PIO0_25
#undef DMA0_TRIG16_PIO0_26
#undef DMA0_TRIG16_PIO0_27
#undef DMA0_TRIG16_PIO0_28
#undef DMA0_TRIG17_PIO0_23
#undef DMA0_TRIG17_PIO0_24
#undef DMA0_TRIG17_PIO0_25
#undef DMA0_TRIG17_PIO0_26
#undef DMA0_TRIG17_PIO0_27
#undef DMA0_TRIG17_PIO0_28
#undef DMA0_TRIG18_PIO0_23
#undef DMA0_TRIG18_PIO0_24
#undef DMA0_TRIG18_PIO0_25
#undef DMA0_TRIG18_PIO0_26
#undef DMA0_TRIG18_PIO0_27
#undef DMA0_TRIG18_PIO0_28
#undef DMA0_TRIG19_PIO0_23
#undef DMA0_TRIG19_PIO0_24
#undef DMA0_TRIG19_PIO0_25
#undef DMA0_TRIG19_PIO0_26
#undef DMA0_TRIG19_PIO0_27
#undef DMA0_TRIG19_PIO0_28
#undef DMA0_TRIG1_PIO0_23
#undef DMA0_TRIG1_PIO0_24
#undef DMA0_TRIG1_PIO0_25
#undef DMA0_TRIG1_PIO0_26
#undef DMA0_TRIG1_PIO0_27
#undef DMA0_TRIG1_PIO0_28
#undef DMA0_TRIG20_PIO0_23
#undef DMA0_TRIG20_PIO0_24
#undef DMA0_TRIG20_PIO0_25
#undef DMA0_TRIG20_PIO0_26
#undef DMA0_TRIG20_PIO0_27
#undef DMA0_TRIG20_PIO0_28
#undef DMA0_TRIG21_PIO0_23
#undef DMA0_TRIG21_PIO0_24
#undef DMA0_TRIG21_PIO0_25
#undef DMA0_TRIG21_PIO0_26
#undef DMA0_TRIG21_PIO0_27
#undef DMA0_TRIG21_PIO0_28
#undef DMA0_TRIG22_PIO0_23
#undef DMA0_TRIG22_PIO0_24
#undef DMA0_TRIG22_PIO0_25
#undef DMA0_TRIG22_PIO0_26
#undef DMA0_TRIG22_PIO0_27
#undef DMA0_TRIG22_PIO0_28
#undef DMA0_TRIG23_PIO0_23
#undef DMA0_TRIG23_PIO0_24
#undef DMA0_TRIG23_PIO0_25
#undef DMA0_TRIG23_PIO0_26
#undef DMA0_TRIG23_PIO0_27
#undef DMA0_TRIG23_PIO0_28
#undef DMA0_TRIG24_PIO0_23
#undef DMA0_TRIG24_PIO0_24
#undef DMA0_TRIG24_PIO0_25
#undef DMA0_TRIG24_PIO0_26
#undef DMA0_TRIG24_PIO0_27
#undef DMA0_TRIG24_PIO0_28
#undef DMA0_TRIG25_PIO0_23
#undef DMA0_TRIG25_PIO0_24
#undef DMA0_TRIG25_PIO0_25
#undef DMA0_TRIG25_PIO0_26
#undef DMA0_TRIG25_PIO0_27
#undef DMA0_TRIG25_PIO0_28
#undef DMA0_TRIG26_PIO0_23
#undef DMA0_TRIG26_PIO0_24
#undef DMA0_TRIG26_PIO0_25
#undef DMA0_TRIG26_PIO0_26
#undef DMA0_TRIG26_PIO0_27
#undef DMA0_TRIG26_PIO0_28
#undef DMA0_TRIG27_PIO0_23
#undef DMA0_TRIG27_PIO0_24
#undef DMA0_TRIG27_PIO0_25
#undef DMA0_TRIG27_PIO0_26
#undef DMA0_TRIG27_PIO0_27
#undef DMA0_TRIG27_PIO0_28
#undef DMA0_TRIG28_PIO0_23
#undef DMA0_TRIG28_PIO0_24
#undef DMA0_TRIG28_PIO0_25
#undef DMA0_TRIG28_PIO0_26
#undef DMA0_TRIG28_PIO0_27
#undef DMA0_TRIG28_PIO0_28
#undef DMA0_TRIG29_PIO0_23
#undef DMA0_TRIG29_PIO0_24
#undef DMA0_TRIG29_PIO0_25
#undef DMA0_TRIG29_PIO0_26
#undef DMA0_TRIG29_PIO0_27
#undef DMA0_TRIG29_PIO0_28
#undef DMA0_TRIG2_PIO0_23
#undef DMA0_TRIG2_PIO0_24
#undef DMA0_TRIG2_PIO0_25
#undef DMA0_TRIG2_PIO0_26
#undef DMA0_TRIG2_PIO0_27
#undef DMA0_TRIG2_PIO0_28
#undef DMA0_TRIG3_PIO0_23
#undef DMA0_TRIG3_PIO0_24
#undef DMA0_TRIG3_PIO0_25
#undef DMA0_TRIG3_PIO0_26
#undef DMA0_TRIG3_PIO0_27
#undef DMA0_TRIG3_PIO0_28
#undef DMA0_TRIG4_PIO0_23
#undef DMA0_TRIG4_PIO0_24
#undef DMA0_TRIG4_PIO0_25
#undef DMA0_TRIG4_PIO0_26
#undef DMA0_TRIG4_PIO0_27
#undef DMA0_TRIG4_PIO0_28
#undef DMA0_TRIG5_PIO0_23
#undef DMA0_TRIG5_PIO0_24
#undef DMA0_TRIG5_PIO0_25
#undef DMA0_TRIG5_PIO0_26
#undef DMA0_TRIG5_PIO0_27
#undef DMA0_TRIG5_PIO0_28
#undef DMA0_TRIG6_PIO0_23
#undef DMA0_TRIG6_PIO0_24
#undef DMA0_TRIG6_PIO0_25
#undef DMA0_TRIG6_PIO0_26
#undef DMA0_TRIG6_PIO0_27
#undef DMA0_TRIG6_PIO0_28
#undef DMA0_TRIG7_PIO0_23
#undef DMA0_TRIG7_PIO0_24
#undef DMA0_TRIG7_PIO0_25
#undef DMA0_TRIG7_PIO0_26
#undef DMA0_TRIG7_PIO0_27
#undef DMA0_TRIG7_PIO0_28
#undef DMA0_TRIG8_PIO0_23
#undef DMA0_TRIG8_PIO0_24
#undef DMA0_TRIG8_PIO0_25
#undef DMA0_TRIG8_PIO0_26
#undef DMA0_TRIG8_PIO0_27
#undef DMA0_TRIG8_PIO0_28
#undef DMA0_TRIG9_PIO0_23
#undef DMA0_TRIG9_PIO0_24
#undef DMA0_TRIG9_PIO0_25
#undef DMA0_TRIG9_PIO0_26
#undef DMA0_TRIG9_PIO0_27
#undef DMA0_TRIG9_PIO0_28
#undef DMIC0_CLK0_PIO0_26
#undef DMIC0_DATA0_PIO0_27
#undef ENET_MDC_PIO4_15
#undef ENET_MDIO_PIO4_16
#undef FC0_RXD_SDA_MOSI_PIO0_24
#undef FC0_SCK_PIO0_28
#undef FC0_TXD_SCL_MISO_PIO0_25
#undef FC2_RXD_SDA_MOSI_PIO0_26
#undef FC2_TXD_SCL_MISO_PIO0_27
#undef FC9_RXD_SDA_MOSI_PIO4_15
#undef FC9_TXD_SCL_MISO_PIO4_16
#undef GPIO_PIO023_PIO0_23
#undef GPIO_PIO024_PIO0_24
#undef GPIO_PIO025_PIO0_25
#undef GPIO_PIO026_PIO0_26
#undef GPIO_PIO027_PIO0_27
#undef GPIO_PIO028_PIO0_28
#undef GPIO_PIO415_PIO4_15
#undef GPIO_PIO416_PIO4_16
#undef MCLK_PIO0_23
#undef PINT_PINT0_PIO0_23
#undef PINT_PINT0_PIO0_24
#undef PINT_PINT0_PIO0_25
#undef PINT_PINT0_PIO0_26
#undef PINT_PINT0_PIO0_27
#undef PINT_PINT0_PIO0_28
#undef PINT_PINT1_PIO0_23
#undef PINT_PINT1_PIO0_24
#undef PINT_PINT1_PIO0_25
#undef PINT_PINT1_PIO0_26
#undef PINT_PINT1_PIO0_27
#undef PINT_PINT1_PIO0_28
#undef PINT_PINT2_PIO0_23
#undef PINT_PINT2_PIO0_24
#undef PINT_PINT2_PIO0_25
#undef PINT_PINT2_PIO0_26
#undef PINT_PINT2_PIO0_27
#undef PINT_PINT2_PIO0_28
#undef PINT_PINT3_PIO0_23
#undef PINT_PINT3_PIO0_24
#undef PINT_PINT3_PIO0_25
#undef PINT_PINT3_PIO0_26
#undef PINT_PINT3_PIO0_27
#undef PINT_PINT3_PIO0_28
#undef PINT_PINT4_PIO0_23
#undef PINT_PINT4_PIO0_24
#undef PINT_PINT4_PIO0_25
#undef PINT_PINT4_PIO0_26
#undef PINT_PINT4_PIO0_27
#undef PINT_PINT4_PIO0_28
#undef PINT_PINT5_PIO0_23
#undef PINT_PINT5_PIO0_24
#undef PINT_PINT5_PIO0_25
#undef PINT_PINT5_PIO0_26
#undef PINT_PINT5_PIO0_27
#undef PINT_PINT5_PIO0_28
#undef PINT_PINT6_PIO0_23
#undef PINT_PINT6_PIO0_24
#undef PINT_PINT6_PIO0_25
#undef PINT_PINT6_PIO0_26
#undef PINT_PINT6_PIO0_27
#undef PINT_PINT6_PIO0_28
#undef PINT_PINT7_PIO0_23
#undef PINT_PINT7_PIO0_24
#undef PINT_PINT7_PIO0_25
#undef PINT_PINT7_PIO0_26
#undef PINT_PINT7_PIO0_27
#undef PINT_PINT7_PIO0_28
#undef SCT0_IN0_PIO0_24
#undef SCT0_IN0_PIO0_25
#undef SCT0_IN1_PIO0_24
#undef SCT0_IN1_PIO0_25
#undef SCT0_IN2_PIO0_24
#undef SCT0_IN2_PIO0_25
#undef SCT0_IN3_PIO0_24
#undef SCT0_IN3_PIO0_25
#undef SCT0_IN4_PIO0_24
#undef SCT0_IN4_PIO0_25
#undef SCT0_IN5_PIO0_24
#undef SCT0_IN5_PIO0_25
#undef SCT0_IN6_PIO0_24
#undef SCT0_IN6_PIO0_25
#undef SCT0_OUT4_PIO0_23
#undef SCT0_OUT5_PIO0_26
#undef SCT0_OUT6_PIO0_27
#undef SCT0_OUT7_PIO0_28
#undef SDIF_SD_D0_PIO0_24
#undef SDIF_SD_D1_PIO0_25
#undef SPIFI0_SPIFI_IO2_PIO0_28
#undef SPIFI0_SPIFI_IO3_PIO0_27
#undef SPIFI_CLK_PIO0_26
#undef SPIFI_CSN_PIO0_23
#undef SPIFI_IO0_PIO0_24
#undef SPIFI_IO1_PIO0_25
#undef SWD_TRACEDATA3_PIO0_28
#undef SYSCON_FREQMEA_PIO0_11
#undef SYSCON_FREQMEA_PIO1_4
#undef SYSCON_FREQMEB_PIO0_12
#undef SYSCON_FREQMEB_PIO2_7
#undef USB0_IDVALUE_PIO0_26
#undef USB0_OVERCURRENTN_PIO0_28
#undef USB0_UP_LED_PIO1_14
#undef USB0_UP_LED_PIO2_15
#undef USB0_UP_LED_PIO4_8
#undef USB1_UP_LED_PIO1_30
#undef USB1_UP_LED_PIO2_17
#undef USB1_UP_LED_PIO4_10

/* Signals specific to this part */
#define FC10_RTS_SCL_SSEL1_PIO2_22 IOCON_MUX(86, IOCON_TYPE_D, 6)
#define FC10_RXD_SDA_MOSI_PIO1_1 IOCON_MUX(33, IOCON_TYPE_D, 6)
#define FC10_SCK_PIO1_3 IOCON_MUX(35, IOCON_TYPE_D, 8)
#define FC10_SSEL2_PIO2_23 IOCON_MUX(87, IOCON_TYPE_D, 6)
#define FC10_SSEL3_PIO2_24 IOCON_MUX(88, IOCON_TYPE_D, 6)
#define FC10_TXD_SCL_MISO_PIO1_2 IOCON_MUX(34, IOCON_TYPE_D, 6)
#define FREQME_GPIO_CLK_A_PIO0_11 IOCON_MUX(11, IOCON_TYPE_D, 3)
#define FREQME_GPIO_CLK_A_PIO1_4 IOCON_MUX(36, IOCON_TYPE_D, 5)
#define FREQME_GPIO_CLK_B_PIO0_12 IOCON_MUX(12, IOCON_TYPE_D, 3)
#define FREQME_GPIO_CLK_B_PIO2_7 IOCON_MUX(71, IOCON_TYPE_D, 3)
#define USB0_LEDN_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 5)
#define USB0_LEDN_PIO2_15 IOCON_MUX(79, IOCON_TYPE_D, 2)
#define USB0_LEDN_PIO4_8 IOCON_MUX(136, IOCON_TYPE_D, 4)
#define USB1_LEDN_PIO1_30 IOCON_MUX(62, IOCON_TYPE_D, 5)
#define USB1_LEDN_PIO2_17 IOCON_MUX(81, IOCON_TYPE_D, 2)
#define USB1_LEDN_PIO4_10 IOCON_MUX(138, IOCON_TYPE_D, 4)

#endif /* _ZEPHYR_DTS_BINDING_LPC54018J4MET180_WRAPPER_ */
